inference/inference-Leonardo/results/vllm/sonnet/Llama-3.1-8B-Instruct/Nodes_4-GPUs_4-TP_16-PP_1/launch-1/logs_benchmarking_1000-concurrency.log
INFO 09-15 15:59:51 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=2950, endpoint='/v1/completions', dataset=None, dataset_name='sonnet', dataset_path='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/benchmarks/datasets/sonnet.txt', max_concurrency=1000, model='/leonardo_scratch/large/userinternal/rscheda0/models/Llama-3.1-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/results/vllm/sonnet/Llama-3.1-8B-Instruct/Nodes_4-GPUs_4-TP_16-PP_1/launch-1/Concurrency_1000.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1000
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  35.73     
Total input tokens:                      509089    
Total generated tokens:                  150000    
Request throughput (req/s):              27.99     
Output token throughput (tok/s):         4198.37   
Total Token throughput (tok/s):          18447.34  
---------------Time to First Token----------------
Mean TTFT (ms):                          14026.09  
Median TTFT (ms):                        10206.46  
P99 TTFT (ms):                           27469.20  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          57.49     
Median TPOT (ms):                        58.05     
P99 TPOT (ms):                           59.42     
---------------Inter-token Latency----------------
Mean ITL (ms):                           57.49     
Median ITL (ms):                         55.26     
P99 ITL (ms):                            92.20     
==================================================